# FailedUpdateCurveChain Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GeometryFailures..::..FailedUpdateCurveChain Property
BuiltInFailures..::..GeometryFailures Class See Also
---
Failed to update curve chain.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FailedUpdateCurveChain { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FailedUpdateCurveChain As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FailedUpdateCurveChain {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GeometryFailures Class
Autodesk.Revit.DB Namespace